FINAL-PROJECT-TUGAS_2-API-Feedback_Resto_Favorite-18222082-Ahmad_Habibie_Marjan-codeigniter4-framework-2849e7f/app/Models/BranchDetailsModel.php

SELECT `branches`.`id` as `branch_id`, `branches`.`name` as `branch_name`, `branches`.`location`, `menu_items`.`id` as `menu_id`, `menu_items`.`name` as `menu_name`, `menu_items`.`price`, `feedbacks`.`id` as `feedback_id`, `feedbacks`.`comment`, `feedbacks`.`rating`, `feedbacks`.`menu_item_id`, `users`.`name` as `user_name`
FROM `branches`
LEFT JOIN `menu_items` ON `menu_items`.`branch_id` = `branches`.`id`
LEFT JOIN `feedbacks` ON `feedbacks`.`branch_id` = `branches`.`id`
LEFT JOIN `users` ON `feedbacks`.`user_id` = `users`.`id`
ORDER BY `branches`.`id`, `menu_items`.`id`, `feedbacks`.`id`
---
    public function getBranchesWithDetails()
    {
        return $this->select('branches.id as branch_id, branches.name as branch_name, branches.location, menu_items.id as menu_id, menu_items.name as menu_name, menu_items.price, feedbacks.id as feedback_id, feedbacks.comment, feedbacks.rating, feedbacks.menu_item_id, users.name as user_name')
                    ->join('menu_items', 'menu_items.branch_id = branches.id', 'left')
                    ->join('feedbacks', 'feedbacks.branch_id = branches.id', 'left')
                    ->join('users', 'feedbacks.user_id = users.id', 'left')
                    ->orderBy('branches.id, menu_items.id, feedbacks.id')
                    ->findAll();