FINAL-PROJECT-TUGAS_2-API-Feedback_Resto_Favorite-18222082-Ahmad_Habibie_Marjan-codeigniter4-framework-2849e7f/app/Models/GiveFeedbackModel.php

SELECT `id`, `name`
FROM `branches`
---
    public function getBranches()
    {
        return $this->db->table('branches')
            ->select('id, name')
            ->get()
            ->getResultArray();