FINAL-PROJECT-TUGAS_2-API-Feedback_Resto_Favorite-18222082-Ahmad_Habibie_Marjan-codeigniter4-framework-2849e7f/app/Models/MyFeedbackModel.php

    public function getFeedbacksByUser($userId)
    {
        return $this->select('feedbacks.*, branches.name as branch_name, menu_items.name as menu_item_name, menu_items.price as menu_price')
            ->join('branches', 'feedbacks.branch_id = branches.id', 'left')
            ->join('menu_items', 'feedbacks.menu_item_id = menu_items.id', 'left')
            ->where('feedbacks.user_id', $userId)
            ->orderBy('feedbacks.created_at', 'DESC')
            ->findAll();
---
SELECT `feedbacks`.*, `branches`.`name` as `branch_name`, `menu_items`.`name` as `menu_item_name`, `menu_items`.`price` as `menu_price`
FROM `feedbacks`
LEFT JOIN `branches` ON `feedbacks`.`branch_id` = `branches`.`id`
LEFT JOIN `menu_items` ON `feedbacks`.`menu_item_id` = `menu_items`.`id`
WHERE `feedbacks`.`user_id` = '1'
ORDER BY `feedbacks`.`created_at` DESC